tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "santerj/boss-katana"
brew "ansible"
brew "awscli"
brew "glib"
brew "dos2unix"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gobject-introspection"
brew "grep"
brew "gron"
brew "hadolint"
brew "ncurses"
brew "htop"
brew "httpie"
brew "iftop"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "mailhog"
brew "yt-dlp"
brew "mpv"
brew "nemu"
brew "nmap"
brew "node"
brew "pipx"
brew "pulumi"
brew "python@3.10"
brew "ripgrep"
brew "source-highlight"
brew "speedtest-cli"
brew "sslscan"
brew "switchaudio-osx"
brew "telnet"
brew "tfenv"
brew "tree"
brew "unzip"
brew "watch"
brew "wget"
brew "xonsh"
brew "zsh-syntax-highlighting"
cask "chromium"
cask "cryptomator"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "fontbase"
cask "google-drive"
cask "karabiner-elements"
cask "katana-driver"
cask "katana-tone-studio-mk1"
cask "lunacy"
cask "macs-fan-control"
cask "rectangle"
cask "signal"
cask "sony-ps-remote-play"
cask "spotify"
cask "steam"
cask "telegram"
cask "tunnelblick"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "vpn-by-google-one"
cask "zoom"
vscode "4ops.terraform"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "GitHub.github-vscode-theme"
vscode "hediet.vscode-drawio"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "xabikos.JavaScriptSnippets"
