tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "santerj/boss-katana"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Core application library for C
brew "glib"
# Tool for exploring each layer in a docker image
brew "dive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# OpenType text shaping engine
brew "harfbuzz"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Text-based UI library
brew "ncurses"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Linguistic software and Finnish dictionary
brew "libvoikko"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Podman Terminal User Interface
brew "podman-tui"
# Cloud native development platform
brew "pulumi"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Source-code syntax highlighter
brew "source-highlight"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Image editing and design software
cask "affinity"
# Agent orchestration platform
cask "antigravity"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Photography workflow application and raw developer
cask "darktable"
# Universal database tool and SQL client
cask "dbeaver-community"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Web browser
cask "firefox"
# Font manager
cask "fontbase"
# Audio converter and CD ripper
cask "freac"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# USB driver for BOSS Katana amplifiers
cask "santerj/boss-katana/katana-driver"
# Visual editor for BOSS Katana (Mk1) amplifiers
cask "santerj/boss-katana/katana-tone-studio-mk1"
# Audio tagger focusing on efficiency
cask "kid3"
# Graphic design software
cask "lunacy"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Music tagger
cask "musicbrainz-picard"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok/ngrok/ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Third-party Remote Play client for PlayStation consoles
cask "pxplay"
# Digital audio production application
cask "reaper"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Automated installer for the Rockbox digital music player firmware
cask "rockboxutility"
# Instant messaging application focusing on security
cask "signal"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Original Xbox Emulator
cask "xemu"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "codacy-app.codacy"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hediet.vscode-drawio"
vscode "mk12.better-git-line-blame"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sanjulaganepola.github-local-actions"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
