tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "santerj/boss-katana"
brew "ansible"
brew "awscli"
brew "icu4c@76"
brew "glib"
brew "dos2unix"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-task"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "hadolint"
brew "ncurses"
brew "htop"
brew "httpie"
brew "iftop"
brew "jq"
brew "lazydocker"
brew "mailhog"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "node"
brew "pipx"
brew "podman"
brew "pyenv"
brew "python-setuptools"
brew "python@3.10"
brew "ripgrep"
brew "source-highlight"
brew "sslscan"
brew "tree"
brew "unzip"
brew "watch"
brew "websocat"
brew "wget"
brew "zsh-syntax-highlighting"
cask "audacity"
cask "chromium"
cask "cryptomator"
cask "dbeaver-community"
cask "dolphin"
cask "firefox"
cask "fontbase"
cask "freac"
cask "google-drive"
cask "karabiner-elements"
cask "katana-driver"
cask "katana-tone-studio-mk1"
cask "kid3"
cask "lastfm"
cask "lunacy"
cask "macs-fan-control"
cask "musicbrainz-picard"
cask "ngrok"
cask "rectangle"
cask "signal"
cask "sony-ps-remote-play"
cask "spotify"
cask "steam"
cask "telegram"
cask "tunnelblick"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "xemu"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
